# Написать регулярку для проверки валидности ip адреса.
# Как правило, адрес записывается в виде четырёх десятичных чисел значением
# от 0 до 255, разделённых точками, например, 192.168.0.3.
# правильные:
# 192.168.0.1
# 10.0.0.1
# 172.16.0.0
# 255.255.255.0
# 232.12.0.14
# 111.111.111.111
# 0.0.0.0
# неправильные:
# 256.257.258.259
# 2516.257.258.259
# 1921.168.0.1
# 10.1233.0.1
# 172.16.7890.0
# 255.255.255.68779
# 232.0.14
# 111.111.111.111.123

import re

if __name__ == "__main__":
    ip_checker = re.compile(r'\b(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9]?[0-9])\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9]?[0-9])\s+')